Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter.IntegerValue Property
 The integer value of the profile item parameter.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IntegerValue { get; set; }
Public Property IntegerValue As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace